"""Шаг 1: Находим координаты пересечения"""
xx1 = max(x1_A, x1_B) = max(10, 15) = 15  # Самый правый левый край
yy1 = max(y1_A, y1_B) = max(20, 25) = 25  # Самый нижний верхний край
xx2 = min(x2_A, x2_B) = min(50, 55) = 50  # Самый левый правый край
yy2 = min(y2_A, y2_B) = min(60, 65) = 60  # Самый верхний нижний край

"""Шаг 2: Проверяем, есть ли пересечение"""
if xx2 > xx1 or yy2> yy1:
    """Шаг 3: Вычисляем площадь пересечения"""
    w = xx2 - xx1 = 50 - 15 = 35 #ширина пересечения
    h = yy2 - yy1 = 60 - 25 = 35 #высота пересечения
    area_overlap = w * H = 35 * 35 = 1225 # Площадь пересечения
    
    """Шаг 4: Вычисляем площадь каждого прямоугольника"""
    area_A = (x2_A - x1_A) * (y2_A - y1_A) = (50 - 10)*(60-20) = 40*40 = 1600
    area_B = (x2_B - x1_B) * (y2_B - y1_B) = (55 - 15)*(65-25) = 40*40 = 1600
    
    """Шаг 5: Отношение пересечения к площади"""
    overlap_A = area_overlap / area_A = 1225 / 1600 = 0.77  # 77%
    overlap_B = area_overlap / area_B = 1225 / 1600 = 0.77  # 77%